MultiTreader/src/InformationRegisters/РеестрЗаданийМенеджераФЗ/РеестрЗаданийМенеджераФЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеестрЗаданийМенеджераФЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеРабочегоПотока</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПорций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НастройкиЗадания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЖурналМенеджера</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторМенеджера</name>
    <type>
      <types>CatalogRef.ИдентификаторыМенеджераПотоков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючНастроек</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MultiTreader/src/Catalogs/ИдентификаторыМенеджераПотоков/ИдентификаторыМенеджераПотоков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыМенеджераПотоков</name>
  <predefined>
    <items>
      <name>_АвтоТестирование_</name>
      <description>_АвтоТестирование_</description>
    </items>
    <items>
      <name>_КорректировкаВзаиморасчетов_</name>
      <description>_КорректировкаВзаиморасчетов_</description>
    </items>
    <items>
      <name>_ОбработкаОбъектов_</name>
      <description>_ОбработкаОбъектов_</description>
    </items>
    <items>
      <name>ккГенераторЗаявокПереносНеисполненныхЗаявок</name>
      <description>Генератор заявок, перенос неисполненных заявок</description>
    </items>
    <items>
      <name>ккГенераторЗаявокСозданиеАктуализацияЗаявок</name>
      <description>Генератор заявок, создание и актуализация заявок</description>
    </items>
    <items>
      <name>ЗаполнениеОчередиТрансляции</name>
      <description>Заполнение очереди трансляции</description>
    </items>
    <items>
      <name>_ЗачетАвансов_</name>
      <description>Зачет авансов отложенно</description>
    </items>
    <items>
      <name>_ОтложеннаяОбработкаОчереди_</name>
      <description>Отложенная обработка очереди (документы себестоимости)</description>
    </items>
    <items>
      <name>_ОтложенноеПроведение_</name>
      <description>Отложенное проведение документов себестоимости</description>
    </items>
    <items>
      <name>_ТрансляцияДвиженийМСФО_</name>
      <description>Трансляция движений МСФО</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭлементовКолекцииНаПоток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускатьИзУказанногоФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиЗадания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

MultiTreader/src/InformationRegisters/РеестрЗаданийМенеджераФЗ/Forms/ФормаЗаписиУпр/Module.bsl
&НаКлиенте
Перем ТекИдентификаторМенеджера;


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Запись.КлючНастроек = Неопределено;
		Запись.ПериодРегистрации = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ПериодРегистрации) Тогда
		Запись.ПериодРегистрации = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НастройкиМенеджера = ТекущийОбъект.НастройкиЗадания.Получить();
	
	ЕстьНастройки = ?(НастройкиМенеджера = Неопределено, Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкиЗадания = Новый ХранилищеЗначения(НастройкиМенеджера);
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.КлючНастроек) Тогда
		ТекущийОбъект.КлючНастроек = Новый УникальныйИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДекорацииНастроек();
	
	ТекИдентификаторМенеджера = Запись.ИдентификаторМенеджера;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ккЗаполнениеНастроекЗаданияМенеджера" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			
			НастройкиМенеджера = Параметр;
			ЕстьНастройки = Истина;
			ОбновитьДекорацииНастроек();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОткрытьНастройки(Команда)
	
	Если Не ЗначениеЗаполнено(Запись.ИдентификаторМенеджера) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФайла = ПолучитьВнешнююОбработкуПоИдентификатору(Запись.ИдентификаторМенеджера);
	
	Если ПараметрыФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыФайла.ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
		
		ТекстСообщения = НСтр("ru ='Для данного идентификатора не указана внешняя обработка настроек.'");
		Сообщить(ТекстСообщения);
		Возврат;

	КонецЕсли;
	
	ПолноеИмяФайла = КаталогВременныхФайлов() + ПараметрыФайла.ИмяФайлаОбработки;
	ПараметрыФайла.ДвоичныеДанные.Записать(ПолноеИмяФайла);
	
	АдресХранилища = "";
	Результат = ПоместитьФайл(АдресХранилища, ПолноеИмяФайла, , Ложь);
	ИмяОбработки = ПодключитьВнешнююОбработку(АдресХранилища);
	
	Если ТипЗнч(НастройкиМенеджера) <> Тип("Структура") Тогда
		НастройкиМенеджера = Новый Структура;
	КонецЕсли;
		
	Попытка
		ПутьКФорме = СтрШаблон("ВнешняяОбработка.%1.Форма", ИмяОбработки);
		ПараметрыФормы = Новый Структура("НастройкиМенеджера", НастройкиМенеджера);
		ОткрытьФорму(ПутьКФорме, ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	УдалитьФайлы(ПолноеИмяФайла);

КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторМенеджераПриИзменении(Элемент)
	
	Если ТекИдентификаторМенеджера <> Запись.ИдентификаторМенеджера Тогда
		
		НастройкиМенеджера = Неопределено;
		ЕстьНастройки = Ложь;
		ТекИдентификаторМенеджера = Запись.ИдентификаторМенеджера;
		ОбновитьДекорацииНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища)
	ОписаниеЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
	ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
	Возврат ВнешниеОбработки.Подключить(АдресХранилища, ,Ложь, ОписаниеЗащиты);
КонецФункции

&НаКлиенте
Процедура ОбновитьДекорацииНастроек()
	
	Если ЕстьНастройки Тогда
		Элементы.НадписьПредупреждение.Заголовок = НСтр("ru ='Настройки заполнены'");
		Элементы.ЗаполнитьНастройки.Заголовок    = НСтр("ru ='Открыть'");
	Иначе
		Элементы.НадписьПредупреждение.Заголовок = НСтр("ru ='Настройки не заполнены'");
		Элементы.ЗаполнитьНастройки.Заголовок    = НСтр("ru ='Заполнить'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВнешнююОбработкуПоИдентификатору(Идентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ккИдентификаторыМенеджераПотоков.Хранилище,
	|	ккИдентификаторыМенеджераПотоков.ИмяФайлаОбработки
	|ИЗ
	|	Справочник.ИдентификаторыМенеджераПотоков КАК ккИдентификаторыМенеджераПотоков
	|ГДЕ
	|	ккИдентификаторыМенеджераПотоков.Ссылка = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Если РезультатЗапроса.Следующий() Тогда
		
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("ИмяФайлаОбработки", РезультатЗапроса.ИмяФайлаОбработки);
		ПараметрыФайла.Вставить("ДвоичныеДанные"   , РезультатЗапроса.Хранилище.Получить());
		
		Возврат ПараметрыФайла;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
